examples/homuPorousInterFoam/porousDamBreak/constant/homuPorosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      homuPorosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

varepsilonMin varepsilonMin [ 0 0 0 0 0 0 0 ] 0.01;
varepsilonMax varepsilonMax [ 0 0 0 0 0 0 0 ] 1.0;

// drag calculation
dragForceActive yes;

// Ergun drag: effective diameter
//dpEff dpEff [ 0 1 0 0 0 0 0 ] 3.0e-3;
dpEff dpEff [ 0 1 0 0 0 0 0 ] 1.0e-3;




// ************************************************************************* //
