examples/homuPorousInterFoam/porousDamBreak/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       19800;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       19900;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       20000;
    }
    porosityWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       20080;
    }
    atmosphere
    {
        type            patch;
        nFaces          80;
        startFace       20120;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       20200;
    }
)

// ************************************************************************* //
