examples/homuPorousInterFoam/porousDamBreak/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//application     interFoam;
application     homuPorousInterFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

//endTime         0.25;
//endTime         1;
endTime         1.5;
//endTime         2.5;

deltaT          0.001;
//deltaT          1.0e-4;


writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;
//adjustTimeStep  no;

//maxCo           1;
//maxAlphaCo      1;

maxCo           0.1;
maxAlphaCo      0.1;


maxDeltaT       1;


// ************************************************************************* //
